In [63]:
import numpy as np
import pandas as pd

In [64]:
# dealing with missing values in Pandas

In [65]:
# notice, vals1 is assigned an an object, because that's the best Python can do with the 'None' 
# but vals2 is a assigned an int64, as all the values in the array are ints

vals1 = np.array([1, None, 3, 4])
print(vals1.dtype)

vals2 = np.array([1,2,3])
print(vals2.dtype)

object
int64

In [66]:
# notice that when the dtype is correctly assigned, the computing overhead is more optimized

for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
22 ms ± 88.7 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
635 µs ± 17.6 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [67]:
# also, if u perform funcs on arrays with none, you'll get an error

try: 
    vals1.sum()
except (TypeError, NameError):
    print('Errorrrrrr!')

Errorrrrrr!

In [68]:
# NaN is different!
# NaN is a special floating-point value that's used by the standard IEEE

vals1 = np.array([1,2,np.nan,4])
vals1.dtype

dtype('float64')

In [69]:
1 + np.nan

nan

In [70]:
1 * np.nan

nan

In [71]:
# note that numpy does provide some ufuncs that will deal with NaNs

np.nansum(vals1), np.nanmin(vals1), np.nanmax(vals1)

(7.0, 1.0, 4.0)

In [72]:
# Pandas is built to be able to handle both None and NaN!
# Also note, Pandas automatically upcasts None to a NaN when possible
### there is a table in 3.04 that shows when this does or doesn't happen!

pd.Series([1,np.nan,3,None])

0    1.0
1    NaN
2    3.0
3    NaN
dtype: float64

In [73]:
# operating on null values

# isnull()  -  generate a boolean mask indicating missing values
# notnull()  -  opposite of isnull()
# dropna()  -  return a filtered version of the data
# fillna()  -  return a copy of the data with missing data filled in

In [74]:
# example data

data = pd.Series([1, np.nan, 'hello', None])

In [75]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [76]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [77]:
data_clean = data.dropna()
data_clean

0        1
2    hello
dtype: object

In [78]:
# another example

df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [79]:
# by default, dropna() automatically drops rows with any missing data

df.dropna()

     0    1  2
1  2.0  3.0  5

In [80]:
# but we can specify more in the function

# ex: only drop columns with missing data
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [81]:
# there is also thresh and how attributes that let you specify how many
# missing values must be present, or if all must be missing in order to drop!

df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [82]:
# this will only drop column 3

df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [83]:
# finding null values

# example data
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [84]:
# we can fill the NaN data if we choose

data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [85]:
# we can choose to forward-fill or back-fill

data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [86]:
# for DataFrames, the options are similar, but we can also specify an axis on which the fills take place
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [87]:
df.fillna(method='ffill', axis='columns')

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [88]:
x1 = pd.DataFrame([[1,2,3,4,5],
            [6,7,8,9,10],
            [11,12,13,14,15]], columns=list('ABCDE'))
x1

    A   B   C   D   E
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [89]:
x1['B'] = np.NaN
x1

    A   B   C   D   E
0   1 NaN   3   4   5
1   6 NaN   8   9  10
2  11 NaN  13  14  15

In [93]:
x1.iloc[:2]

   A   B  C  D   E
0  1 NaN  3  4   5
1  6 NaN  8  9  10